       Identification Division.
       Program-Id. HELLO.
      ***************************************************************** 
      * The canonical Hello, World! program
      ***************************************************************** 
       Procedure Division.
           display "Hello, World!"
           goback
           .