           05  REC-KEY        PIC 9(04).
           05  REC-FIELD-1    PIC X(10).
           05  REC-FIELD-2    PIC X(05).
           05  REC-FIELD-3    PIC X(15).
           05  REC-FIELD-4    PIC X(06).
           05  REC-FIELD-5    PIC X(05).
           05  FILLER         PIC X(35).
