       Identification Division.
       Program-Id. TABSRCH.
      *****************************************************************
      * Follow the instructions given in source comments.
      *****************************************************************
       Data Division.
       Working-Storage Section.



       Procedure Division.


           goback
           .
