//DBAD03D JOB (529),'ASSEMBLE MAP',CLASS=A,MSGCLASS=A,
//             MSGLEVEL=(1,1),NOTIFY=&SYSUID
//*
//* TO ASSEMBLE CICS BMS MAP
//*
//PLIB    JCLLIB ORDER=(MATE1.PROCLIB)
//CICSMAP  EXEC DFHMAPS,
//         COPYLIB=DBAD03.COPYLIB,       <= SYMBOLIC MAP COPY LIBRARY
//         SRCLIB=DBAD03.CICS.MAPLIB,    <= SOURCE LIBRARY
//         MEMBER=EMPEQ01                <= MAP MEMBER NAME
//*
